Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Using `OidcClient` to support the `authorization code` grant might be required if you cannot use the xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC extension] to support Authorization Code Flow.
ja_jp: xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC エクステンション] を使用して認可コードフローをサポートできない場合は、 `OidcClient` を使用して `authorization code` グラントをサポートする必要がある場合があります。

source: Using `OidcClient` to support the `authorization code` grant might be required if, for some reason, you cannot use the xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC extension] to support Authorization Code Flow. If there is a very good reason for you to implement Authorization Code Flow, then you can configure `OidcClient` as follows:
ja_jp: 何らかの理由で xref:security-oidc-code-flow-authentication.adoc[Quarkus OIDC エクステンション] を使用して認可コードフローをサポートできない場合、 `OidcClient` を使用して `authorization code` グラントをサポートすることが必要になる場合があります。認可コードフローを実装する正当な理由がある場合は、 `OidcClient` を次のように設定します。

source: Using `OidcSession` for local logout
ja_jp: `OidcSession` をローカルログアウトに使用

source: Using `OidcTestClient` to test such configuration requires acquiring a token from the Auth0 dev tenant, using either OAuth2 `password` or `client_credentials` grant, we will try a `password` grant. Make sure the application registered in the Auth0 dashboard allows the `password` grant:
ja_jp: `OidcTestClient` を使用してこのような設定をテストするには、OAuth2 `password` または `client_credentials` グラントのいずれかを使用して、Auth0 開発テナントからトークンを取得する必要があります。ここでは `password` グラントを使用します。Auth0 ダッシュボードに登録されているアプリケーションが `password` グラントを許可していることを確認してください。

source: Using `RestResponse` as the return type while making sure the proper redirection URI is created can be done as in the following example:
ja_jp: `RestResponse` を戻り値の型として使用し、適切なリダイレクトURIを作成することは、以下の例のように可能です:

source: Using `ThreadContext` or `ManagedExecutor` you can wrap most useful functional types and `CompletionStage` in order to get context propagated.
ja_jp: `ThreadContext` または `ManagedExecutor` を使用することで、ほとんどの有用な関数型と `CompletionStage` をラップしてコンテキストを伝播させることができます。

source: Using `Uni` or `@NonBlocking` means that the request will be executed on Event-loop threads rather than Worker threads.
ja_jp: `Uni` または `@NonBlocking` を使用すると、リクエストは Worker スレッドではなく Event-loop スレッドで実行されます。

source: Using `Uni` or `CompletionStage` means that when a request contains more than one query, they will be executed concurrently.
ja_jp: `Uni` または `CompletionStage` を使用すると、リクエストに複数のクエリが含まれている場合、それらが同時に実行されることになります。

source: Using `client_secret_jwt` or `private_key_jwt` authentication methods ensures that a client secret does not get sent to the OIDC provider, therefore avoiding the risk of a secret being intercepted by a 'man-in-the-middle' attack.
ja_jp: `client_secret_jwt` 、または `private_key_jwt` 認証方法を使用することで、クライアントシークレットがOIDCプロバイダに送信されないため、「中間者」攻撃によってシークレットが傍受されるリスクを回避できます。

source: Using `client_secret_jwt` or `private_key_jwt` authentication methods ensures that a client secret is not sent to the OIDC provider, thereby avoiding the risk of interception by a 'man-in-the-middle' attack.
ja_jp: `client_secret_jwt` または `private_key_jwt` 認証メソッドを使用すると、クライアントシークレットが OIDC プロバイダーに送信されないため、中間者攻撃による傍受のリスクを回避できます。

source: Using `client_secret_jwt` or `private_key_jwt` authentication methods ensures that no client secret goes over the wire.
ja_jp: `client_secret_jwt` または `private_key_jwt` 認証方法を使用することで、クライアントシークレットが漏れることはありません。

source: Using `io.quarkus.logging.Log` in extensions:
ja_jp: エクステンションで `io.quarkus.logging.Log` を使用する:

source: Using `java.util.concurrent.Future` and classes that extend it as return types of repository methods.
ja_jp: `java.util.concurrent.Future` と、それをリポジトリーメソッドのリターンタイプとして拡張するクラスを使用します。

source: Using `org.springframework.data.jpa.repository.JpaSpecificationExecutor`
ja_jp: `org.springframework.data.jpa.repository.JpaSpecificationExecutor` の使用

source: Using `persistence.xml` is incompatible with using `quarkus.hibernate-orm.*` properties in `{config-file}`: if you mix them, Quarkus will raise an exception.
ja_jp: `persistence.xml` を使用することは、 `{config-file}` における `quarkus.hibernate-orm.*` プロパティーの使用とは互換性がありません。 これらを混在させると、Quarkus は例外をスローします。

source: Using `quarkus-oidc-client`, `quarkus-rest-client-oidc-filter` and `quarkus-resteasy-client-oidc-filter` extensions to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers such as link:https://www.keycloak.org[Keycloak].
ja_jp: `quarkus-oidc-client`、 `quarkus-rest-client-oidc-filter` および `quarkus-resteasy-client-oidc-filter` エクステンションを使用して、OpenID Connect や link:https://www.keycloak.org[Keycloak] などの OAuth 2.0 準拠の認可サーバーからアクセストークンを取得し、更新する。

source: Using `quarkus-rest-client-oidc-token-propagation` and `quarkus-resteasy-client-oidc-token-propagation` extensions to propagate the current `Bearer` or `Authorization Code Flow` access tokens.
ja_jp: `quarkus-rest-client-oidc-token-propagation` と `quarkus-resteasy-client-oidc-token-propagation` のエクステンションを使用して、現在の `Bearer` または `Authorization Code Flow` アクセストークンを伝播する。

source: Using `strings` you can also get Mandrel information given the binary:
ja_jp: `strings` を使えば、指定されたバイナリのMandrel情報を得ることもできます。

source: Using a Credentials Provider
ja_jp: クレデンシャルプロバイダーの使用

source: Using a Distroless base image
ja_jp: Distroless ベースイメージの使用

source: Using a Metrics API-specific implementation
ja_jp: メトリクス API 固有の実装の使用

source: Using a Mock HTTP Server for tests
ja_jp: テストにモックHTTPサーバーを使用する

source: Using a PostgreSQL socket factory is not possible in dev mode at the moment due to issue link:https://github.com/quarkusio/quarkus/issues/15782[#15782].
ja_jp: link:https://github.com/quarkusio/quarkus/issues/15782[#15782]の問題により、現時点ではdevモードではPostgreSQLのソケットファクトリを使用することはできません。

source: Using a `Multi<PersonEvent>` would produce:
ja_jp: `Multi<PersonEvent>` を使用すると、以下が生成されます。

source: Using a `persistence.xml` file implies a few constraints:
ja_jp: `persistence.xml` ファイルを使用する場合は、いくつかの制約が伴います。

source: Using a built-in JDBC driver extension automatically includes the Agroal extension, which is the JDBC connection pool implementation applicable for custom and built-in JDBC drivers. However, for custom drivers, Agroal needs to be added explicitly.
ja_jp: 組込JDBC ドライバのエクステンションを使用すると、カスタムと組込JDBC ドライバーに適用可能な JDBC 接続プールの実装である Agroal エクステンションが自動的に含まれます。 しかし、カスタムドライバーの場合、Agroal を明示的に追加する必要があります。

source: Using a configuration file
ja_jp: 設定ファイルの使用

source: Using a custom bundler such as Webpack, Parcel, Rollup, etc. This can be easily integrated with Quarkus using the https://docs.quarkiverse.io/quarkus-quinoa/dev/[Quarkus Quinoa extension].
ja_jp: Webpack、Parcel、Rollupなどのカスタムバンドラーを使用します。 link:https://docs.quarkiverse.io/quarkus-quinoa/dev/[Quarkus Quinoaエクステンション] を使用すると、Quarkusと簡単に統合できます。

source: Using a custom image that controls waiting for the Job
ja_jp: ジョブ待機をコントロールするカスタム画像の使用

source: Using a custom wait-for container image
ja_jp: カスタムwait-forコンテナイメージの使用

source: Using a demand higher than 1 is useful when multiple items shall be returned and the production of each item takes some time, i.e. when parallel/concurrent production improves the service response time. Be aware the concurrent processing also requires more resources and puts a higher load on services or resources that are needed to produce the items. Also consider using `Multi.capDemandsTo(long)` and `Multi.capDemandsUsing(LongFunction)`.
ja_jp: 1 より大きい demand を使用すると、複数のアイテムを返す必要があり、各アイテムの生成に時間がかかる場合に有用です。つまり、並列/並行処理によってサービスの応答時間が向上する場合に役立ちます。ただし、並行処理はより多くのリソースを必要とし、アイテムの生成に必要なサービスやリソースに対する負荷が上昇することに注意してください。また、 `Multi.capDemandsTo(long)` および `Multi.capDemandsUsing(LongFunction)` の使用も検討してください。

source: Using a different Kotlin version in a Quarkus application is typically not recommended. But in order to do so, you must import the Kotlin BOM *before* the Quarkus BOM.
ja_jp: 通常、Quarkus アプリケーションで別の Kotlin バージョンを使用することはお勧めしません。 ただしそうする必要がある場合は、Quarkus BOM の *前に* Kotlin BOM をインポートする必要があります。

source: Using a different configuration profile at runtime from the one used to build the application can lead to unexpected results.
ja_jp: アプリケーションのビルド時に使用したものとは異なる設定プロファイルを実行時に使用すると、予期しない結果を招く可能性があります。

source: Using a local GraalVM installation
ja_jp: ローカルにインストールした GraalVM の使用

source: Using a map based approach, it is also possible to configure named persistence units:
ja_jp: マップベースのアプローチで名前付きの永続化ユニットを構成することも可能です:

source: Using a map based approach, it is possible to define named persistence units:
ja_jp: マップをベースにした方法で名前付きの永続化ユニットを定義することができます:

source: Using a multi-stage Docker build
ja_jp: マルチステージDockerビルドの使用

source: Using a range instead of pages
ja_jp: ページの代わりにレンジを使用

source: Using a runtime property
ja_jp: 実行時プロパティの使用

source: Using a scratch base image
ja_jp: スクラッチベースイメージの使用

source: Using a source file
ja_jp: ソースファイルの使用

source: Using a very high value for -XX:MaxRAMPercentage (allocating most of the available RAM to the Java heap) is not recommended for Quarkus applications, as it’s important to leave room for Netty's native memory allocations.
ja_jp: -XX:MaxRAMPercentage に非常に高い値を使用すること (利用可能なRAMのほとんどをJavaヒープに割り当てること) は、Nettyのネイティブメモリ割り当て用の領域を残すことが重要であるため、Quarkusアプリケーションでは推奨されません。

source: Using an external database instead
ja_jp: 外部データベースを代用する

source: Using an in-container build
ja_jp: コンテナー内ビルドの使用

source: Using annotations
ja_jp: アノテーションの使用

source: Using annotations is limited, as you can't dynamically assign meaningful tag values. Also note that many methods, e.g. REST endpoint methods or Vert.x Routes, are counted and timed by the micrometer extension out of the box.
ja_jp: 意味のあるタグ値を動的に割り当てることができないため、アノテーションの使用には制限があります。また、RESTエンドポイント・メソッドやVert.x Routesなどの多くのメソッドは、最初から無設定でmicrometerエクステンションによってカウントされ、時間が計測されることに注意してください。

source: Using attributes to modify the prerequisites
ja_jp: 属性を使用した前提条件の変更

source: Using both `Forwarded` and `X-Forwarded` headers can have security implications as it may allow clients to forge requests with a header that is not overwritten by the proxy.
ja_jp: `Forwarded` と `X-Forwarded` の両方のヘッダーを使用すると、クライアントがプロキシによって上書きされないヘッダーでリクエストを偽造することができるため、セキュリティ上問題があります。

source: Using both the extension and the plugin requires special configuration, if you add both you will get lots of errors about classes already being instrumented. The configuration needed is detailed below.
ja_jp: エクステンションとプラグインの両方を使用するには、特別な設定が必要です。両方を追加すると、すでにインスツルメンテーションされているクラスに関する多くのエラーが発生します。必要な設定の詳細は以下のとおりです。

source: Using cert-manager
ja_jp: cert-manager の使用

source: Using certificate attributes to augment SecurityIdentity
ja_jp: 証明書属性を使用して SecurityIdentity を強化する

source: Using codecs
ja_jp: コーデックの利用

source: Using common resources
ja_jp: 共通のリソースの利用

source: Using compatible versions of the Apicurio Registry
ja_jp: 互換性のあるバージョンのApicurio Registryの使用

source: Using configuration
ja_jp: 設定の使用

source: Using credentials
ja_jp: クレデンシャルの使用

source: Using docker in the non-Linux environment, you can create an image using this Dockerfile via:
ja_jp: Linux 以外の環境で docker を使用する場合は、以下を実行し、この Dockerfile を使用してイメージを作成できます。

source: Using existing resources
ja_jp: 既存のリソースの利用

source: Using extensions gives you some property wiring as well as the build time optimisations and native image compilation:
ja_jp: エクステンションを使用すると、プロパティーの設定や、ビルド時間の最適化、ネイティブイメージのコンパイルも行うことができます:

source: Using fast-jar
ja_jp: fast-jar の使用

source: Using gRPC CLI
ja_jp: gRPC CLIの使用

source: Using gRPC Health probes
ja_jp: gRPC ヘルスプローブの使用

source: Using gRPC with Quarkus
ja_jp: Quarkus で gRPC を使用する

source: Using generated gRPC classes from dependencies
ja_jp: 依存関係から生成された gRPC クラスを使用する

source: Using https://docs.quarkiverse.io/quarkus-web-bundler/dev/[the Quarkus Web Bundler extension], which is the recommended way. Without any configuration, it puts everything together in an instant, and follows good practices such as dead-code elimination, minification, caching, and more.
ja_jp: 推奨の方法として、 https://docs.quarkiverse.io/quarkus-web-bundler/dev/[Quarkus Web Bundler エクステンション] を使用します。設定なしですべてを瞬時にまとめ、デッドコードの除去、縮小、キャッシュなどの適切なプラクティスに従います。

source: Using injection
ja_jp: 依存性注入の使用

source: Using injection, with qualifiers and producers when necessary.
ja_jp: 必要に応じて qualifiers や producers を用いたインジェクションを使用。

source: Using internal controllers
ja_jp: 内部コントローラーの使用

source: Using lazy initialization speeds up your application startup time, and avoids startup failures if the Cassandra database is not available. However, it could also prove dangerous if your code is fully asynchronous, e.g. if you are using https://quarkus.io/guides/reactive-routes[reactive routes]: indeed, the lazy initialization could accidentally happen on a thread that is not allowed to block, such as a Vert.x event loop thread. Therefore, setting `quarkus.cassandra.init.eager-init` to `false` and injecting `QuarkusCqlSession` should be avoided in these contexts.
ja_jp: 遅延初期化を使用すると、アプリケーションの起動時間が短縮され、Cassandra データベースが利用できない場合に起動が失敗しないようになります。ただし、完全に非同期のコードを使用している場合には、リスクが発生する可能性があります。たとえば、 https://quarkus.io/guides/reactive-routes[reactive routes] を使用する場合には、Vert.x イベントループスレッドなど、ブロックされるべきでないスレッドで遅延初期化が誤って発生してしまう可能性があります。そのため、このようなコンテキストでは `quarkus.cassandra.init.eager-init` を `false` に設定して `QuarkusCqlSession` の挿入は避けるべきです。

source: Using lazy initialization speeds up your application startup time, and avoids startup failures if the Cassandra database is not available. However, it could also prove dangerous if your code is fully non-blocking, for example if it uses xref:reactive-routes.adoc[reactive routes]. Indeed, the lazy initialization could accidentally happen on a thread that is not allowed to block, such as a Vert.x event loop thread. Therefore, setting `quarkus.cassandra.init.eager-init` to `false` and injecting `QuarkusCqlSession` should be avoided in these contexts.
ja_jp: 遅延初期化を使用すると、アプリケーションの起動時間が短縮され、Cassandraデータベースが利用できない場合の起動失敗を回避できます。ただし、コードが完全にノンブロッキングである場合、たとえば xref:reactive-routes.adoc[リアクティブ・ルート] を使用している場合などは、危険であることがわかります。実際、遅延初期化は、Vert.xイベント・ループ・スレッドなど、ブロックが許可されていないスレッドで誤って発生する可能性があります。したがって、 `quarkus.cassandra.init.eager-init` を `false` に設定し、 `QuarkusCqlSession` を注入することは、このようなコンテキストでは避けるべきです。

source: Using legacy decision tables
ja_jp: レガシー意思決定テーブルの使用

source: Using link:{mutiny}[Mutiny APIs] in incoming and outgoing signatures allow you to process the stream of messages:
ja_jp: 着信署名と発信署名でリンク:{mutiny}[Mutiny APIs] を使用すると、メッセージのストリームを処理できます。

source: Using metrics-API specific implementations may be preferred in some cases. Jaeger, for example, defines its own metrics interface, `io.jaegertracing.spi.MetricsFactory`, that it uses to define counters and gauges. A direct mapping from that interface to the metrics system will be the most efficient. In this case, it is important to isolate these specialized implementations and to avoid eager classloading to ensure the metrics API remains an optional, compile-time dependency.
ja_jp: metrics-API 固有の実装を使用することが、状況によっては優先される場合があります。たとえば、Jaeger は、カウンターとゲージを定義するために使用する独自のメトリクスインターフェイス `io.jaegertracing.spi.MetricsFactory` を定義します。そのインターフェイスからメトリクスシステムへの直接マッピングは最も効率的です。この場合、これらの特殊な実装を分離し、メトリクス API が任意のコンパイル時依存関係を維持できるように、活発なクラスローディングを回避することが重要です。

source: Using mocks with `@InjectMock`
ja_jp: `@InjectMock` を使用したモック

source: Using mongo+srv:// urls
ja_jp: mongo+srv://のURLの使用

source: Using multiple verticles instances
ja_jp: そして、Verticleインスタンスをデプロイします。

source: Using optimistic locking
ja_jp: 楽観ロックの使用

source: Using other Registry implementations
ja_jp: 他のレジストリー実装の使用

source: Using our Tooling
ja_jp: ツールの使用

source: Using plugins such as the https://github.com/brianm/really-executable-jars-maven-plugin[really-executable-jar-maven-plugin] can be handy to simplify the execution of your command line application.
ja_jp: https://github.com/brianm/really-executable-jars-maven-plugin[really-executable-jar-maven-plugin] などのプラグインを使用すると、コマンドラインアプリケーションの実行を簡素化できます。

source: Using profiles
ja_jp: プロファイルの使用

source: Using pub/sub
ja_jp: pub/sub の使用

source: Using response
ja_jp: レスポンスの使用

source: Using same ConfigProperties with different prefixes
ja_jp: 同じ ConfigProperties で異なる接頭辞を使用

source: Using sections
ja_jp: セクションの使用

source: Using specific Compose files
ja_jp: 特定の Compose ファイルの使用

source: Using standards made development, and learning, the codebase easier
ja_jp: 標準仕様を使用することで、コードベースの開発や学習が容易になりました

source: Using such a classic configuration file is an option, but unnecessary unless you have specific advanced needs; so we'll see first how Hibernate ORM can be configured without a `persistence.xml` resource.
ja_jp: このような古典的な設定ファイルを使用することは選択しとしてありますが、特定の高度なニーズがない限り不要です。 そのため、まずはHibernate ORMを `persistence.xml` リソース無しで設定できることをみていきましょう。

source: Using such a construct means that a `--initialize-at-run-time` option will automatically be added to the `native-image` command line.
ja_jp: このような構文を使用すると、 `--initialize-at-run-time` オプションが自動的に `native-image` コマンドラインに追加されることを意味します。

source: Using such a construct means that a `-H:DynamicProxyConfigurationResources` option will automatically be added to the `native-image` command line.
ja_jp: このような構文を使用すると、 `-H:DynamicProxyConfigurationResources` オプションが自動的に `native-image` コマンドラインに追加されることを意味します。

source: Using the @Counted interceptor.
ja_jp: @Counted インターセプターの使用。

source: Using the @RegisterForReflection annotation
ja_jp: @RegisterForReflection アノテーションの使用

source: Using the @Timed interceptor.
ja_jp: @Timed インターセプターの使用。

source: Using the AWS Java SDK v2
ja_jp: AWS Java SDK v2 の使用

source: Using the CLI
ja_jp: CLI の使用

source: Using the CLI or Maven plugin to generate a project with your codestart:
ja_jp: CLIまたはMavenプラグインを使用して、codestartでプロジェクトを生成:

source: Using the Cassandra Client
ja_jp: Cassandra クライアントの使用

source: Using the Confluent Schema Registry
ja_jp: Confluent Schema Registryの使用

source: Using the Dynamic client
ja_jp: dynamic クライアントの使用

source: Using the Elasticsearch Java Client
ja_jp: Elasticsearch Javaクライアントの使用

source: Using the Flyway object
ja_jp: Flyway オブジェクトの使用

source: Using the High Level REST Client
ja_jp: 高レベルRESTクライアントの使用

source: Using the Infinispan Client
ja_jp: Infinispanクライアントの使用

source: Using the JBang quarkusio catalog
ja_jp: JBangのquarkusioカタログの使用

source: Using the JsonWebToken and Claim Injection
ja_jp: JsonWebToken とクレーム挿入の使用

source: Using the Kubernetes Client to Interact with a Kubernetes Cluster
ja_jp: Kubernetesクライアントを使ったKubernetesクラスタとの対話

source: Using the Kubernetes client
ja_jp: Kubernetes クライアントの使用

source: Using the Liquibase object
ja_jp: Liquibaseオブジェクトの使用

source: Using the Micrometer OTLP registry
ja_jp: Micrometer OTLP レジストリーの使用

source: Using the Micrometer Prometheus registry
ja_jp: Micrometer Prometheus レジストリーの使用

source: Using the MongoDB Client
ja_jp: MongoDB クライアントの利用

source: Using the Mutiny stub, you can interact with these as follows:
ja_jp: Mutinyのスタブを使用すると、以下のようにこれらとやりとりすることができます。

source: Using the Quarkus CLI
ja_jp: Quarkus CLIの使用

source: Using the Quarkus Extension for Spring Cache
ja_jp: Spring Cache APIのためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring Cloud Config
ja_jp: Spring Cloud ConfigのためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring DI API
ja_jp: Spring DI APIのためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring Data JPA API
ja_jp: Spring Data JPA APIのためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring Scheduled
ja_jp: Spring Scheduled のためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring Security API
ja_jp: Spring Security APIのためのQuarkusエクステンションの使用

source: Using the Quarkus Extension for Spring Web API
ja_jp: Spring Web APIのためのQuarkusエクステンションの使用

source: Using the Quarkus Kubernetes extension, developers can perform or automate a single-step deployment using Jib, Docker, and Source-to-Image (S2i) including the creation of DeploymentConfig to trigger automatic redeployments.
ja_jp: Quarkus Kubernetesエクステンションを使用すると、開発者はJib、Docker、Source-to-Image (S2i) を使用してシングルステップのデプロイメントを実行または自動化できます。これには、自動再デプロイをトリガーするためのDeploymentConfigの作成も含まれます。

source: Using the Quarkus OIDC extension, both Bearer Token and Authorization Code Flow mechanisms use <<smallrye-jwt, SmallRye JWT>> to represent JWT tokens as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: Quarkus OIDCエクステンションを使用することで、ベアラートークンと認可コードフローの両方のメカニズムで link:#smallrye-jwt[SmallRye JWT] を使用して、JWTトークンをMicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken` として表現できます。

source: Using the Quarkus OIDC extension, both the Bearer token and Authorization Code Flow authentication mechanisms use <<smallrye-jwt-authentication>> to represent JWT tokens as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken`.
ja_jp: Quarkus OIDC エクステンションを使用すると、ベアラートークンと認可コードフロー認証メカニズムの両方が <<smallrye-jwt-authentication>> を使用して、JWT トークンを MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken` として表します。

source: Using the REST Client
ja_jp: REST クライアントの利用

source: Using the REST Client (including JSON)
ja_jp: RESTクライアントの使用（JSONを含む）

source: Using the REST Client Reactive
ja_jp: REST Client Reactiveの使用

source: Using the REST Client Reactive is as simple as creating an interface using the proper JAX-RS and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/ExtensionsService.java` and have the following content:
ja_jp: REST Client Reactive の使用は、適切な JAX-RS および MicroProfile アノテーションを使用してインターフェイスを作成するのと同じくらい簡単です。この場合、インターフェイスは `src/main/java/org/acme/rest/client/ExtensionsService.java` に作成され、次の内容が含まれている必要があります。

source: Using the REST Client Reactive is as simple as creating an interface using the proper Jakarta REST and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/ExtensionsService.java` and have the following content:
ja_jp: REST Client Reactive の使用方法は、適切な Jakarta REST と MicroProfile アノテーションを使用してインターフェースを作成するだけで十分です。この場合、インターフェースは `src/main/java/org/acme/rest/client/ExtensionsService.java` で作成し、以下の内容を持つ必要があります:

source: Using the REST Client is as simple as creating an interface using the proper Jakarta REST and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/ExtensionsService.java` and have the following content:
ja_jp: REST Client の使用は、適切な Jakarta REST および MicroProfile アノテーションを使用してインターフェイスを作成するのと同じくらい簡単です。今回の場合、インターフェイスは `src/main/java/org/acme/rest/client/ExtensionsService.java` で作成し、以下の内容を持つ必要があります。

source: Using the REST Client with Multipart
ja_jp: マルチパートでのRESTクライアントの使用

source: Using the RESTEasy Classic REST Client (including JSON)
ja_jp: RESTEasy Classic REST Clientの使用（JSONを含む）

source: Using the RESTEasy REST Client is as simple as creating an interface using the proper JAX-RS and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/ExtensionsService.java` and have the following content:
ja_jp: RESTEasy REST Client の利用は、適切な JAX-RS と MicroProfile アノテーションを使用してインターフェースを作成するのと同じくらい簡単です。今回の場合、インタフェースは `src/main/java/org/acme/rest/client/ExtensionsService.java` として、以下のような内容で作成します。

source: Using the RESTEasy REST Client is as simple as creating an interface using the proper JAX-RS and MicroProfile annotations. In our case the interface should be created at `src/main/java/org/acme/rest/client/multipart/MultipartService.java` and have the following content:
ja_jp: RESTEasy REST Client を使用することは、適切な JAX-RS と MicroProfile のアノテーションを使用してインターフェイスを作成することと同じくらい簡単です。今回のケースでは、インターフェイスは `src/main/java/org/acme/rest/client/multipart/MultipartService.java` で作成し、次のような内容にします。
